/*************************************************************************
 * Copyright (c) 2015-2019, NVIDIA CORPORATION. All rights reserved.
 *
 * See LICENSE.txt for license information
 ************************************************************************/

#ifndef NCCL_COMMON_KERNEL_H_
#define NCCL_COMMON_KERNEL_H_

#include "devcomm.h"
#include "reduce_kernel.h"
#include <cstdio>
#include <cstdint>

#include <cuda_runtime.h>
#include <assert.h>

#define Pp if(blockDim.x*blockIdx.x+threadIdx.x==0)printf("%s:%d\n",__FILE__,__LINE__);

// Define min for ssize_t
static __device__ int min(int a, ssize_t b) { return (a < b) ? a : b; }

typedef uint64_t PackType;

// unpack x and y to elements of type T and apply FUNC to each element
template<class FUNC, typename T>
struct MULTI {
  __device__ PackType operator()(const PackType x, const PackType y, const PackType z, const T c1, const T c2) const;
  __device__ PackType operator()(const PackType x, T y, const int alpha) const;
  __device__ PackType operator()(const PackType x, const PackType y, const T alpha) const;
  __device__ PackType operator()(const PackType x, const PackType y) const;
  __device__ PackType operator()(const PackType x, const T alpha) const;
  __device__ PackType operator()(const PackType x) const;
  __device__ PackType r(const PackType w, const PackType S3, const PackType S4) const;
  __device__ PackType LAMBWeightUpdate(const PackType w, T ratio, const PackType rLambdaWeight) const;
  __device__ uint64_t operator()(const uint64_t v, const uint32_t S0, const T unscaleParameter, const  T beta2) const;
};

struct FuncProd2 {
  template<typename T>
  __device__ T operator()(const T x, const T y) const {
    T z = x * y;
    return z;
  }
};

struct FuncSub2 {
  template<typename T> 
  __device__ T operator()(const T x, const T y) const {
    return x - y;
  }
};

template<typename T> 
struct FuncSum2 {
  __device__ T operator()(const T x, const T y) const {
    T z = x + y;
    return z;
  }
};


struct FuncFMA2 {
  template<typename T> 
  __device__ T operator()(const T x, const T y, const T a) const {
    T z = a * x + y;
    return z;
  }
};


template<class FUNC>
struct MULTI<FUNC, int8_t> {
  static_assert(sizeof(PackType) == 2 * sizeof(uint32_t),
      "PackType must be twice the size of uint32_t.");
  union converter {
    PackType storage;
    struct {
      uint32_t a, b;
    };
  };

  __device__ PackType operator()(const PackType x, const PackType y) const {
    converter cx, cy, cr;
    cx.storage = x;
    cy.storage = y;

    // for char, we do these as vector ops
    cr.a = FUNC()(cx.a, cy.a);
    cr.b = FUNC()(cx.b, cy.b);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const int8_t alpha) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const PackType y, const int8_t alpha) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const int8_t y, const int alpha) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const PackType y, const PackType z, const int8_t c1, const int8_t c2) {
    assert(false);
    return x;
  }
  __device__ PackType r(const PackType w, const PackType S3, const PackType S4) const{return 0;}
  __device__ PackType LAMBWeightUpdate(const PackType w, int8_t ratio, const PackType rLambdaWeight) const {return 0;}
  __device__ uint64_t operator()(const uint64_t v, const uint32_t S0, const uint8_t unscaleParameter, const  int8_t beta2) {return 0;}
};

template<class FUNC>
struct MULTI<FUNC, uint8_t> {
  static_assert(sizeof(PackType) == 2 * sizeof(uint32_t),
      "PackType must be twice the size of uint32_t.");
  union converter {
    PackType storage;
    struct {
      uint32_t a, b;
    };
  };

  __device__ PackType operator()(const PackType x, const PackType y) const {
    converter cx, cy, cr;
    cx.storage = x;
    cy.storage = y;

    // for char, we do these as vector ops
    cr.a = FUNC()(cx.a, cy.a);
    cr.b = FUNC()(cx.b, cy.b);

    return cr.storage;
  }

   __device__ PackType operator()(const PackType x) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const uint8_t alpha) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const PackType y, const uint8_t alpha) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const uint8_t y, const int alpha) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const PackType y, const PackType z, const uint8_t c1, const uint8_t c2) {
    assert(false);
    return x;
  }
  __device__ PackType r(const PackType w, const PackType S3, const PackType S4) const{return 0;}
  __device__ PackType LAMBWeightUpdate(const PackType w, uint8_t ratio, const PackType rLambdaWeight) const {return w;}
    __device__ uint64_t operator()(const uint64_t v, const uint32_t S0, const uint8_t unscaleParameter, const  uint8_t beta2) {return 0;}
};

template<class FUNC>
struct MULTI<FUNC, int32_t> {
  static_assert(sizeof(PackType) == 2 * sizeof(int32_t),
      "PackType must be twice the size of int.");
  union converter {
    PackType storage;
    struct {
      int32_t a, b;
    };
  };

  __device__ PackType operator()(const PackType x, const PackType y) const {
    converter cx, cy, cr;
    cx.storage = x;
    cy.storage = y;

    cr.a = FUNC()(cx.a, cy.a);
    cr.b = FUNC()(cx.b, cy.b);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x, const int32_t alpha) {
    converter cx, cr;
    cx.storage = x;

    cr.a = FUNC()(cx.a, alpha);
    cr.b = FUNC()(cx.b, alpha);

    return cr.storage;
  }

  
  __device__ PackType operator()(const PackType x, const PackType y, const int32_t alpha) {
    converter cx, cy, cr;
    cx.storage = x;
    cy.storage = y;

    cr.a = FUNC()(cx.a, cy.a, alpha);
    cr.b = FUNC()(cx.b, cy.b, alpha);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x, const int32_t y, const int32_t alpha) {
    converter cx, cr;
    cx.storage = x;

    cr.a = FUNC()(cx.a, y, alpha);
    cr.b = FUNC()(cx.b, y, alpha);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const PackType y, const PackType z, const int32_t c1, const int32_t c2) {
    converter cx, cy, cz, cr;
    cx.storage = x;
    cy.storage = y;
    cz.storage = z;

    cr.a = FUNC()(cx.a, cy.a, cz.a, c1, c2);
    cr.b = FUNC()(cx.b, cy.b, cz.a, c1, c2);

    return cr.storage;
  }
  __device__ PackType r(const PackType w, const PackType S3, const PackType S4) const{}
  __device__ PackType LAMBWeightUpdate(const PackType w, int32_t ratio, const PackType rLambdaWeight) const {}
    __device__ uint64_t operator()(const uint64_t v, const uint32_t S0, const int32_t unscaleParameter, const  int32_t beta2) {return 0;}
};

template<class FUNC>
struct MULTI<FUNC, uint32_t> {
  static_assert(sizeof(PackType) == 2 * sizeof(uint32_t),
      "PackType must be twice the size of int.");
  union converter {
    PackType storage;
    struct {
      uint32_t a, b;
    };
  };

  __device__ PackType operator()(const PackType x, const PackType y) const {
    converter cx, cy, cr;
    cx.storage = x;
    cy.storage = y;

    cr.a = FUNC()(cx.a, cy.a);
    cr.b = FUNC()(cx.b, cy.b);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x, const uint32_t alpha) {
    converter cx, cr;
    cx.storage = x;

    cr.a = FUNC()(cx.a, alpha);
    cr.b = FUNC()(cx.b, alpha);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x, const PackType y, const uint32_t alpha) {
    converter cx, cy, cr;
    cx.storage = x;
    cy.storage = y;

    cr.a = FUNC()(cx.a, cy.a, alpha);
    cr.b = FUNC()(cx.b, cy.b, alpha);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x, const PackType y, const int alpha) {
    converter cx, cy, cr;
    cx.storage = x;
    cy.storage = y;

    cr.a = FUNC()(cx.a, cy.a, alpha);
    cr.b = FUNC()(cx.b, cy.b, alpha);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x, const uint32_t y, const int alpha) {
    converter cx, cr;
    cx.storage = x;

    cr.a = FUNC()(cx.a, y, alpha);
    cr.b = FUNC()(cx.b, y, alpha);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x, const PackType y, const PackType z, const uint32_t c1, const uint32_t c2) {
    converter cx, cy, cz, cr;
    cx.storage = x;
    cy.storage = y;
    cz.storage = z;

    cr.a = FUNC()(cx.a, cy.a, cz.a, c1, c2);
    cr.b = FUNC()(cx.b, cy.b, cz.a, c1, c2);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x) {
    assert(false);
    return x;
  }
  __device__ PackType r(const PackType w, const PackType S3, const PackType S4) const{}
  __device__ PackType LAMBWeightUpdate(const PackType w, int32_t ratio, const PackType rLambdaWeight) const {}
    __device__ uint64_t operator()(const uint64_t v, const uint32_t S0, const uint32_t unscaleParameter, const  uint32_t beta2) {return 0;}
};

template<class FUNC>
struct MULTI<FUNC, half> {
  static_assert(sizeof(PackType) == 4 * sizeof(half),
      "PackType must be four times the size of half.");

  struct PackHalf2 {
    half2 a, b;
  };
  
  __device__ PackType operator()(const PackType x, const PackType y) const {
    struct PackHalf2 cx, cy, cr;
    cx = *(reinterpret_cast<const struct PackHalf2*>(&x));
    cy = *(reinterpret_cast<const struct PackHalf2*>(&y));

    cr.a = FUNC()(cx.a, cy.a);
    cr.b = FUNC()(cx.b, cy.b);

    return *(reinterpret_cast<PackType*>(&cr));
  }

  __device__ PackType operator()(const PackType x, const half alpha) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const PackType y, const half alpha) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const half y, const int alpha) {
    assert(false);
    return x;
  }

  __device__ PackType operator()(const PackType x, const PackType y, const PackType z, const half c1, const half c2) {
    assert(false);
    return x;
  }
  __device__ PackType r(const PackType w, const PackType S3, const PackType S4) const{}
  __device__ PackType LAMBWeightUpdate(const PackType w, half ratio, const PackType rLambdaWeight) const {}
    __device__ uint64_t operator()(const uint64_t v, const uint32_t S0, const half unscaleParameter, const  half beta2) {return 0;}
};

template<class FUNC>
struct MULTI<FUNC, float> {
  static_assert(sizeof(PackType) == 2 * sizeof(float),
      "PackType must be twice the size of float.");
  union converter {
    PackType storage;
    struct {
      float a, b;
    };
  };


  __device__ PackType operator()(const PackType x, const PackType y) const {
    converter cx, cy, cr;
    cx.storage = x;
    cy.storage = y;

    cr.a = FUNC()(cx.a, cy.a);
    cr.b = FUNC()(cx.b, cy.b);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x, const float alpha) {
    converter cx, cr;
    cx.storage = x;

    cr.a = FUNC()(cx.a, alpha);
    cr.b = FUNC()(cx.b, alpha);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x, const PackType y, const float alpha) {
    converter cx, cy, cr;
    cx.storage = x;
    cy.storage = y;

    cr.a = FUNC()(cx.a, cy.a, alpha);
    cr.b = FUNC()(cx.b, cy.b, alpha);

    return cr.storage;
  }

  __device__ PackType operator()(const PackType x) {
     converter cx, cr;
    cx.storage = x;

